# GetConditionUpperValue Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationServiceButton..::..GetConditionUpperValue Method
FabricationServiceButton Class See Also
---
Gets the condition upper value (valid if less) for a given condition index.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public double GetConditionUpperValue(
	int condition
)
```

Visual Basic
---
```text
Public Function GetConditionUpperValue ( _
	condition As Integer _
) As Double
```

Visual C++
---
```text
public:
double GetConditionUpperValue(
	int condition
)
```

# ### Parameters
condition
    Type: System..::..Int32 The condition index.
# ### Return Value
The condition upper value.
# Remarks
A value of -1 indicates an unrestricted value.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The index condition is not larger or equal to 0 and less than ConditionCount. |

# See Also
FabricationServiceButton Class
Autodesk.Revit.DB Namespace